
INSERT INTO book
VALUES
("001","9123456780",'数据库原理','张三','人民邮电出版社','2010-6-6',52),
("002","9123456781",'计算机组成原理','李四','清华大学出版社','2012-5-8',68),
("003","9123456782",'linux操作系统','王二','清华大学出版社','2009-10-20',32),
("004","9123456783",'java程序设计','麻子','科学出版社','2008-6-9',55),
("005","9123456784",'网络规划与设计','小美','中华出版社','2011-2-9',66),
("006","9123456785",'路由与交换','小明','中国人民大学出版社','2011-5-30',58),
("007","9123456786",'数据结构','华子','清华大学出版社','2010-5-10',48),
("008","9123456787",'网络技术实训','张华','人民邮电出版社','2006-8-30',42),
("009","9123456788",'嵌入式技术','joy','机械工业出版社','2009-9-20',46),
("010","9123456789",'物联网技术','小花','电子工业出版社','2012-2-10',51);


INSERT INTO student
(Stu_num,Stu_name,Stu_sex,Stu_phone,Stu_yx)
VALUES
("210020","小李","男","6263501","xiaoli@163.com"),
("210010","小张","男","6263510","xiaozhang@163.com"),
("210022","小王","男","6263520","xiaowang@163.com"),
("210021","小红","女","6263560","xiaohong@163.com");

INSERT INTO rule

VALUES
(55410,"2021","30","8","2021-09-30 12:30:01")


INSERT INTO borrow

VALUES
("002","210020",NOW(),DATE_SUB(NOW(),INTERVAL -3 MONTH))
("003","210021",NOW(),DATE_SUB(NOW(),INTERVAL -3 MONTH))
("001","210022",NOW(),DATE_SUB(NOW(),INTERVAL -3 MONTH))
("005","210010",NOW(),DATE_SUB(NOW(),INTERVAL -3 MONTH))
("006","210020",NOW(),DATE_SUB(NOW(),INTERVAL -3 MONTH))
("003","210022",NOW(),DATE_SUB(NOW(),INTERVAL -3 MONTH))
("005","210021",NOW(),DATE_SUB(NOW(),INTERVAL -3 MONTH))
("003","210022",NOW(),DATE_SUB(NOW(),INTERVAL -3 MONTH))
("009","210010",NOW(),DATE_SUB(NOW(),INTERVAL -3 MONTH));

DELETE FROM borrow
WHERE borrow_num="002";
SELECT * FROM book;












